app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "YOOOOOOOOOO"], ["room_number", 1000], ["created_at", "2018-08-13 22:45:40.740762"], ["updated_at", "2018-08-13 22:45:40.740762"]]
---
    def create
        new_school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-08-12 14:39:24.841493"], ["id", 1]]
---
    def update
        school_class = SchoolClass.find(params[:id])
        school_class.update(params.require(:school_class).permit(:title, :room_number))